[
    [
        "This Agreement is made between ABC Corp (\"Provider\") and XYZ Ltd (\"Client\"). \n\n1. Scope of Services Provider will deliver software services to Client as agreed verbally. \n(⚠️ Risk: \"verbally\" leaves ambiguity — contracts should have written scope.) \n\n2. Confidentiality Provider may share client data with third parties for operational efficiency. (⚠️ Risk: Sharing client data violates GDPR/HIPAA unless consent & safeguards exist.) \n\n3. Payment Terms Client agrees to pay $10,000 upon completion. No refunds will be issued under any circumstance. \n(⚠️ Risk: \"no refunds under any circumstance\" may breach consumer protection laws.)\n\n4. Termination Provider may terminate the agreement at any time without notice. \n(⚠️ Risk: Termination without notice is usually non-compliant with fair contract law.) \n\n5. Governing Law This agreement will be governed solely by the laws of Mars Colony Alpha. \n(⚠️ Risk: Invalid jurisdiction, non-enforceable.) Signed, ABC Corp Representative XYZ Ltd Representative",
        {
            "compliant": false,
            "reason": "LLM returned invalid JSON.",
            "suggestion": "Here is my assessment:\n\n**1. Is it compliant?** No\n\n**2. If No, explain why.**\nThis contract section has several compliance issues:\n\n* Section 1: The scope of services is not clearly defined and relies on verbal agreements, which can lead to ambiguity and disputes.\n* Section 2: Sharing client data with third parties without consent and adequate safeguards violates GDPR/HIPAA regulations.\n* Section 3: The \"no refunds under any circumstance\" clause may breach consumer protection laws.\n* Section 4: Terminating the agreement without notice is usually non-compliant with fair contract law.\n* Section 5: The governing law specified is invalid and non-enforceable, as Mars Colony Alpha is not a real jurisdiction.\n\n**3. Suggest a corrected version of the text.**\n\nHere is a rewritten version of the contract section that addresses the compliance issues:\n\nSection:\nThis Agreement is made between ABC Corp (\"Provider\") and XYZ Ltd (\"Client\").\n\n1. Scope of Services\nThe Provider will deliver software services to the Client as described in the attached Scope of Work document, which is incorporated into this Agreement by reference.\n\n2. Confidentiality\nThe Provider will maintain the confidentiality of Client data and will not share it with third parties without the Client's prior written consent. The Provider will implement adequate safeguards to protect Client data in accordance with applicable laws and regulations, including GDPR and HIPAA.\n\n3. Payment Terms\nThe Client agrees to pay $10,000 upon completion of the services. The Provider will provide a detailed invoice to the Client, and payment terms will be net 30 days. The Provider will consider refunds on a case-by-case basis in accordance with applicable laws and regulations.\n\n4. Termination\nEither party may terminate this Agreement upon [insert number] days' written notice to the other party.\n\n5. Governing Law\nThis Agreement will be governed by and construed in accordance with the laws of [insert valid jurisdiction, e.g., the State of California]."
        }
    ]
]